Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: App for Russia
ig: App maka RọshịaApp maka Rọshịa

source: App for Serbia
ig: App maka SabiaApp maka Sabia

source: App for South Africa
ig: App maka Sawụtụ AfrịkaApp maka Sawụtụ Afrịka

source: App for Spain
ig: App maka SpenApp maka Spen

source: App for Uruguay
ig: App maka UruguaApp maka Urugua

source: App for Venezuela
ig: App maka VenezuelaApp maka Venezuela

source: App install error: {error}
ig: Ntinye app nwere ọdachi: {ọdachi}

source: {app_name} screenshot
ig: {app_name} onyonyo ugegbe komputa

source: App not yet reviewed
ig: Enyochagharịbeghị app

source: App Review
ig: Ntụle App

source: Approve / Reject
ig: Kwadoo/jụụ

source: App Statistics
ig: Nchịkọta Ngwa

source: App usage statistics
ig: Nchịkọta ojiji ngwa

source: Arts & Entertainment App
ig: App nkà na ntụrụndụ App nkà na ntụrụndụ

source: Back to app
ig: Gaa azụ na app

source: Back to {app}
ig: Gaa azụ{app}

source: <b>{n}</b> Result
ig: <b>{n}</b> ihe si na ya<b>{n}</b> ihe si na ya

source: <b>"{search_query}"</b> returned {n} result
ig: <b>"{search_query}"</b> lọghachiri {n} ihe si na ya<b>"{search_query}"</b> lọghachiri {n} ihe si na ya

source: Business
ig: Azụmahịa

source: Cancel
ig: Kagbuo

source: Categories
ig: Ogo dị iche iche

source: Compatibility
ig: Dakọtara

source: Content Rating
ig: Ileru ihe dị ya anya

source: Currently Offline
ig: ọnọghị ugbu a

source: Delete
ig: Hichaa

source: Description
ig: Nkọwa

source: Desktop
ig: Igwe komputa

source: Develop Apps
ig: Weputa App ndịọzọ

source: Developer
ig: Mmepụta

source: Display Name
ig: Gosi aha

source: Edit Listing
ig: Dezie ndepụta

source: Edit Review
ig: Dezigharịa nnyocha

source: Edit your review
ig: Dezigharịa ntụleghachi gị

source: Edit your Review
ig: Dezigharịa ntụleghachi gị

source: Education
ig: Agụmakwụkwọ

source: Email Address
ig: Adresị imeelụ

source: Email Support
ig: Enyemaka imeelụ

source: Entertainment
ig: Ntụrụndụ

source: Error while communicating with server. Try again later.
ig: Enwere ọdachi mgbe achọrọ imetụrụ sava. Nwaa ọzọ ma emesịa.

source: Everyone 10+
ig: Onye ọbụla 10+

source: Except where otherwise <a href="{legal_url}" target="_blank">noted</a>, content on this site is licensed under the <a href="{cc_url}" target="_blank">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
ig: ọbụ maọbụ ebe ọpụtara ihe <a href="{legal_url}" ebe elekwasịrị="_ghere oghe">elebara anya</a>, enyefere ikike ihe dị na saịtịa n'aka <a href="{cc_url}" ebe elekwasịrị="_ghere oghe"> Ndị keputara ikike yiri nke a v3.0</a> maọbụ vashọn nke pụtara ikpeazụ.

source: Expand
ig: Dọtịa

source: Featured Book App
ig: Akwụkwọ ngosi App Akwụkwọ ngosi App

source: Featured Creativity App
ig: App ngosi nkepụta ihe App ngosi nkepụta ihe

source: Featured Education App
ig: Ngosi agụmakwụkwọ App Ngosi agụmakwụkwọ App

source: Featured Game
ig: Egwuregwu egosiriEgwuregwu egosiri

source: Featured Lifestyle App
ig: App ngosi mkpebi obibi ndụ App ngosi mkpebi obibi ndụ

source: Featured Music App
ig: Egwu App ndị egosiriEgwu App ndị egosiri

source: Featured Shopping App
ig: App ngosi azụmahịaApp ngosi azụmahịa

source: Featured Social App
ig: App ngosi mmekọrịta mmadụ n’ibe ya App ngosi mmekọrịta mmadụ n’ibe ya

source: Featured Sports App
ig: App ngosi egwuregwu App ngosi egwuregwu

source: Featured Travel App
ig: Ngosi App eji eme nje mNgosi App eji eme nje m

source: Feedback
ig: Nzaghachi

source: Feedback submitted. Thanks!
ig: Inyefeela nzaghach. Imeela!

source: File Size
ig: Ogo faịlụ

source: Firefox OS {version}
ig: Firefox OS{vashọn}

source: Flagged for review
ig: Arụtụla ya aka maka nyocha

source: Flagging review...
ig: Ibido ntụle...

source: Flag Review
ig: Gosi ntụle

source: For ages {0}+
ig: ọtụtụ ọgbọ {0}+

source: For all ages
ig: Maka ọgbọ niile

source: For previous version {version}
ig: Maka vashọn ochie {vashọn}

source: Free
ig: N'efu

source: Games
ig: Egwuregwu

source: General settings
ig: Nhazi niile

source: Generic
ig: ọha mmadụ

source: Get Firefox News.
ig: Nweta ozi Firefox

source: Get Firefox news! Sign up for our newsletter
ig: Nweta ozi Firefox! dejuo maka inweta ozi anyị kwa mgbe

source: Get Help
ig: Nweta Enyemaka

source: Give us your feedback. Let us know whether we are awesome or buggy.
ig: Gwaa anyị nchọpụta gị. Ka anyị mara ma anyị ka anyị si eme.

source: Groundbreaking App
ig: App nke kasị ọhụrụ App nke kasị ọhụrụ

source: Health & Fitness
ig: Ahụike na isi ike

source: Health & Fitness App
ig: App ahụike n'isi ike App ahụike n'isi ike

source: Hidden Gem
ig: Ihe bara nnukwu uru zoro ezoIhe bara nnukwu uru zoro ezo

source: Home
ig: ụlọ

source: Homepage
ig: Peji ịntanetị

source: I'm okay with Mozilla handling my info as explained in <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.
ig: ọmasịrị m ka m si eji Mozilla eme ihe n'ihe gbasara ozi m ka esi kọwaa na <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.

source: Inappropriate language/dialog
ig: Asụsụ adabaghị/mkparịta ụka

source: Install
ig: Tinye

source: Installed
ig: Etinyela ya

source: Installed!
ig: Etinyela ya!

source: Install failed. Please try again later.
ig: Ntinye iheọrụ agaghị. Biko nwaa ọzọ.

source: Language Packs
ig: Ebe ndekọ asụsụ

source: Last updated
ig: Emelitere ikpeazụ

source: Launch this app from your <b>Applications</b> directory.
ig: Mepee app a site na <b>ihe etinyere na ya</b> nduzi.

source: Launch this app from your <b>dash</b>, <b>Application picker</b>, or <b>Applications menu</b>.
ig: Mepee app site na <b>gbara gaa</b>, <b>ihe mwere ngwaọrụ</b>, maọbụ<b>usoro ngwaọrụ</b>.

source: Launch this app from your <b>Windows desktop</b> or <b>Start &#9658; All Programs</b>.
ig: Mepee app site ihe a gị <b>ihu igwe komputa</b> maọbụ <b>Bido&#9658; usoro iheọrụniile</b>.

source: Learn how to change them.
ig: Mụta k'esi agbanwe ha.

source: Leave a Review
ig: Hapụ nnyocha

source: Let us know...
ig: Mee ka anyị mara...

source: Lifestyle
ig: Ibi ndụ

source: Loading...
ig: N'abanye...

source: Loading Privacy Policy...
ig: Imeela maka ịzụ ahịa

source: Load more
ig: Tinyekwuo

source: Local Favorite App
ig: App enwere mmasị na ya n'ogbeApp enwere mmasị na ya n'ogbe

source: Lookup Tool
ig: Iheọrụ eji ele ihe

source: Maps & Navigation
ig: Map na ntụgharị

source: Maps & Navigation App
ig: App map na nke ntụgharị App map na nke ntụgharị

source: Mature 17+
ig: Tozuru 17+

source: Misplaced bug report or support request
ig: Akụkọ ozi gahiere maọbụ nkwado arịrịọ

source: More Information
ig: Ozi ndịọzọ

source: Most Recent Version
ig: Vashọn nke kasị dịrị ọhụrụ

source: Music
ig: Egwu

source: My Apps
ig: App mụ

source: Mystery App!
ig: App nwere iheomimiApp nwere iheomimi

source: My Submissions
ig: Ihe ndị m nyefere

source: Need to report something?
ig: Mkpa ime mkpesa maka ihe ọbụla?

source: New
ig: ọhụrụ

source: Newsletter
ig: Ozi

source: News & Weather App
ig: App ozi n'ihu eluigweApp ozi n'ihu eluigwe

source: No apps found.
ig: Onweghị app ahụrụ.

source: No language packs found.
ig: Onweghị asụsụ ahụrụ

source: No results found
ig: Onweghị ihe ahụrụ

source: No results found, try again later
ig: Onweghị ihe ahụrụ, nwaa ọzọ ma emesịa

source: Not enough statistics to show.
ig: Enweghị nchịkọta zuru oke igosi.

source: Not yet reviewed
ig: Atụlebeghị ya

source: {n} star
ig: {n} Kpakpando{n} kpakpando

source: Oh no!
ig: Hei!

source: Only users that are logged in may submit reviews.
ig: Naanị ndị jị ya eme ihe bụ ndị banyere ga-enyefe ntụle.

source: Payment cancelled.
ig: Akagbuola ụgwọ akwụrụ.

source: Payment failed. Try again later.
ig: ịkwụ ụgwọ agaghị. Nwaa ọzọ ma emesịa.

source: Photo & Video
ig: Foto na ihe nkiri

source: Photo & Video App
ig: App foto na ihe nkiriApp foto na ihe nkiri

source: Please set today's date and time in your device settings to access the Marketplace.
ig: Biko hazie ya taa na oge ka inwe ike baa ọma ahịa.

source: Please sign in to view the receipt
ig: Biko banye iji lee nnabata

source: Popular
ig: N'ewu ewu

source: Premium version available
ig: Vashọn nkeji ka dị

source: Productivity
ig: ịrụpụta ọrụ

source: Rate:
ig: kwuputa

source: Rated {stars} out of {maxstars} stars
ig: Egosila {kpakpando} pụọ na {maxstars} kpakpando

source: Rating Details
ig: Ihe ndị ahụrụ

source: Rating Pending
ig: Ntụle kwụsịtụrụ

source: Rating Refused
ig: ọjụrụ ime ntụle

source: Read all reviews
ig: Gụọ ntụleghachi gị

source: Receipt
ig: Nnabata

source: Recommendations
ig: Eziama

source: Reference
ig: Nkpọtụrụ

source: Region
ig: Mpaghara

source: Register
ig: Debanye

source: Report Abuse
ig: Mee mkpesa

source: Report Trademark Abuse
ig: Gwaa anyị mmebi ikike azụmahịa

source: Reviewer Tools
ig: Iheọrụ onye ntuleghachi

source: Review History
ig: Nyochaa ndekọ

source: Reviews
ig: Nyocha

source: Save Changes
ig: Chekwaa mgbanwe

source: Search Results
ig: Chọọ ihe

source: See an issue with this review? Select a reason below.
ig: Hụụ ihe adabaghị na ntụle a? Họrọ ihe ibu n'uche n'okpuru.

source: Settings
ig: Nhazi

source: Settings could not be saved
ig: Enweghị ike chekwa nhazi gị

source: Shopping
ig: ịzụ ahịa

source: Sign In
ig: Banye

source: Sign in to review
ig: Banye maka ịtuleghachi

source: Sign me up
ig: Webanye m

source: Sign Out
ig: Pụọ

source: Sign up for our newsletter
ig: Dejuo maka inweta ozi anyi kwa mgbe

source: Sign up for our newsletter.
ig: Dejuo maka akụkọ ozi.

source: Social
ig: Mmekọrịta

source: Sorry, there was an error posting your review. Please try again later.
ig: Ewela iwe, enwere ọdachi itibanye ntụle gị. Biko nwaa ọzọ ma emesịa.

source: Sorry, there was an issue editing your review. Please try again later
ig: Ewela iwe enwere nsogbu idezigharị ntụle gị. Biko nwaa ọzọ ma emesia

source: Sorry, there was an issue flagging the review. Please try again later.
ig: Ewela iwe, nwere nsogbu n’ibido ntụle a. Biko nwa ọzọ ma emesịa

source: Sorry, there was a problem deleting the review
ig: Ewela iwe, enwere nsogbu n'ihicha ntụle a.

source: Sorry, we had trouble fetching this app's data. Please try again later.
ig: Ewela iwe, anyị nwere nsogbu ịchọta ndekọ app a.Biko nwaa ọzọ.

source: Sorry, you are currently offline. Please try again later.
ig: Ewela iwe, ịnọghị n'ọrụ ugbu a. Biko nwaa ọzọ ma emesịa

source: Sorry, you need to be online to access the Marketplace.
ig: Ewela iwe, ikwesịrị ịnọ n'ịọrụ iji banye ọma ahịa

source: Sorry, your device clock appears to be set incorrectly.
ig: Ewela iwe, ezighị ezi

source: Spam or otherwise non-review content
ig: Ndị abaghị n'ihe maọbụ ndị atụleghị

source: Sports
ig: Egwuregwu

source: Statistics
ig: ọnụọgụgụ

source: Submit Feedback
ig: Nyefee nzaghachi

source: Submit Report
ig: Nyefee ozi

source: Submit Review
ig: Nyefee ntụle

source: Support
ig: Enyemaka

source: Support Site
ig: Saịtịn'enyeaka

source: System Date Incorrect
ig: ụbọchị dị na igweọrụ abụghị ya

source: Teen
ig: iri na ụma

source: Terms of Use
ig: Iwu eji mee ihe

source: Thanks for signing up!
ig: Imeela maka idebanye!

source: Thank you for purchasing
ig: Imeela maka ịzụ ahịa

source: The category you requested does not exist.
ig: Nkeji ịchọrọ ịhụ adịghị

source: The next time you start the Firefox Marketplace app, you’ll see the updated version!
ig: Mgbe ọzọ ị ga-ebido ọma ahịa app Firefox, ị ga ahụ vashọn nke ọhụrụ ya!

source: There was an error submitting your newsletter sign up request
ig: Enwere ọdachi mgbe a na-eziga ozi maka inweta ozi oge n'oge nke gị

source: There was a problem submitting your feedback. Try again soon.
ig: Enwere nsogbu inyefe nzaghachi gị. Nwaa ọzọ na nso a.

source: This app has no reviews.
ig: App a enweghị ntụle.

source: This review has been successfully deleted
ig: Ewepụrụ ntụleghachi ahụ nkeọma

source: This review has been successfully flagged. Thanks!
ig: Ebidola ntụle ahụ n'enweghị ihe mgbochi. Imeela!

source: Tool & Time Saver
ig: Iheọrụ na ihe nchekwa oge Iheọrụ na ihe nchekwa oge

source: Travel
ig: Ime njem

source: Try again
ig: Nwaa ọzọ

source: Try Again
ig: Nwaa ọzọ

source: Unable to install packaged apps
ig: Onweghị ike tinye app akwadoro maka ya

source: Unavailable
ig: ọdịghị

source: Update Review
ig: Welite ntụle

source: Updates
ig: Ndelite

source: Utilities
ig: ịba uru

source: View All
ig: Lee ha niile

source: We want to hear from you!
ig: Anyị chọrọ ịnụ olu gị!

source: Work & Business App
ig: App ọrụ n’azụmahịa App ọrụ n’azụmahịa

source: Write a review
ig: Dee ntụleghachi gị

source: Write a Review
ig: Dee ntụleghachi

source: Yes, show me recommendations based on my installed apps. <a href="{url}" target="_blank">Learn more</a>
ig: Ee, gosi m nkwenye gị n'adabere na app itinyere.<a href="{url}" target="_blank">mụtakwuo</a>

source: You have no apps
ig: Inweghị App

source: You'll receive an email from mozilla@e.mozilla.org, please check your inbox for your first email from us. If you don’t see it, check your spam filter.
ig: ị ga-enweta ozi imeelụ site n'aka mozilla@e.mozilla.org, biko lee igbeozi gị maka ozi imeelụ mbu nke si anyị n'aka. ọbụrụ n'ịhụghị ya, lee ebe ozi adịghị mkpa n'abanye.

source: You must be signed in to view your apps.
ig: ị ga abanye maka ịhụ app gị.

source: You must use Firefox to install Firefox apps.
ig: ị ga-eji Firefox maka itinye app.

source: Your Mac settings may prevent you from installing apps that do not come from the Mac App Store.
ig: Ntọala Mac gị nwere ike igbochi gị na ịwụnye ngwa ndị na esighi na Ụlọ Ahịa Ngwa Mac.

source: Your review was successfully edited
ig: Eleziri ntụleghachi gị anya nke ọma

source: Your review was successfully posted. Thanks!
ig: Etibanyere ntụle gị nkeọma.Imeela!

source: Your settings have been successfully saved
ig: Echekwala nhazi gị niile

source: An error occurred. Close the window to continue
ig: Mperi dapụtara. Mechie mpio ahụ iji gaa n'ihu

source: An error occurred whilst trying to log out.
ig: Enwere nsogbu mgbe ọ na anwa ịpụ.

source: An internal web request timed out.
ig: Oge gwụnahụrụ ikike web nke ime.

source: An unexpected error occurred.
ig: ọdachi atụghị anya mere.

source: An unexpected error occurred when creating your PIN.
ig: Enwere ọdachi mgbe ana ekepụta ikike mbanye.

source: An unexpected error occurred when resetting your PIN.
ig: Enwere ọdachi mgbe achọrọ idezigharị ikike mbanye gị.

source: An unexpected error occurred whilst checking your PIN.
ig: Enwere ihe mgbochi mgbe ana elebara ikike mbanye gị anya.

source: Are you sure you want to reset your PIN? You must sign in to Firefox Accounts to reset your PIN.
ig: Ichere n'ịchọrọ idezigharị ikike mbanye gị? ị ga abanye na akaụntụ Firefox gị.

source: Are you sure you want to reset your PIN? You must sign in to Persona to reset your PIN.
ig: Ichere n’ịchọrọ idezigharị ikike mbanye gị? ị ga-etinye ihe banyere gị iji me otu ahụ.

source: Beginning payment
ig: N’ebido ịkwụ ụgwọ

source: By proceeding you agree to our <a %(terms)s>terms</a> and <a %(privacy)s>Privacy Policy</a>
ig: Site n'ịga n'ihu ikwerenyere <a %(terms)s>oge</a> na <a %(privacy)s>ikike nzuzo anyị</a>

source: Completing payment
ig: Ana akwụcha ụgwọ

source: Completing Payment
ig: Na-emezu Akwụmụgwọ

source: Confirm PIN
ig: Nabata ikike mbanye

source: Connecting to Firefox Accounts
ig: Iwebanye na akaụntụ Firefox

source: Connecting to Persona
ig: N'ejikọ mbanye gị

source: Create a PIN
ig: kepụta ikike mbanye

source: Create PIN
ig: Kepụta ikike mbanye

source: Enter PIN
ig: Tinye ikike mbanye

source: Error
ig: Ngahie

source: Forgot your PIN?
ig: Ichezọrọ ikike mbanye gị?

source: Initializing
ig: N'abanye

source: Loading
ig: N'abanye

source: Logging out
ig: N'apụ

source: No network simulation
ig: Onweghị netwọk myiri

source: Not you?
ig: ọbụghị gị?

source: No valid user found whilst attempting to create your PIN
ig: Onweghị onye ahụrụ nwe ya mgbe achọrọ ikepụta ikike mbanye gị

source: No valid user found whilst attempting to reset your PIN
ig: Onweghị onye nwe ya ahụrụ mgbe achọrọ idezigharị ikike mbanye gị

source: No valid user found whilst checking your PIN
ig: Onweghị onye ahụrụ nwe ya mgbe ana elebara ikike mbanye gị anya

source: OK
ig: ọdị mma

source: Oops
ig: Ewoo

source: Payment complete
ig: ịkwụ ụgwọ ezuola

source: Payments are temporarily disabled.
ig: Agbanyụrụ ebe ịkwụ ụgwọ na mkpirimkpi oge.

source: Permission denied attempting to check your PIN
ig: Ekweghị ka ịbanye mgbe ịnwara ile maka ikike mbanye gị

source: Permission denied attempting to create your PIN.
ig: Ekweghị ka ịbanye mgbe ịchọrọ ikepụta ikike mbanye gị.

source: Permission denied attempting to reset your PIN.
ig: Ekweghị ka ịbanye dezigharịa ikike mbanye gị.

source: PIN can only contain digits.
ig: Ikike mbanye ga-enwe naanị akara pụrụ iche.

source: PIN Locked
ig: Agbachiela ikike mbanye gị

source: PINs do not match.
ig: Ikike mbanye itinyere amakọghị

source: PIN too short
ig: PIN pere oke mpe

source: Please sign in to reset your PIN.
ig: Banye iji ezigharịa ikike mbanye gị

source: Processing
ig: N'ahazi

source: Reset
ig: Dozigharịa

source: Reset PIN
ig: Dezigharịa ikike mbanye

source: Reset your PIN?
ig: Dezigharịa ikike mbanye gị?

source: Retrieving Transaction
ig: Inwetaghachi azumahịa emere.

source: Retry?
ig: Nwagharịa?

source: Retrying
ig: ịnwagharị

source: Setting up payment
ig: A na eguzobe ịkwụ ụgwọ

source: Sign in
ig: Banye

source: Sign in to continue with the payment
ig: Banye ka iwee kwụọ ụgwọ

source: Sign-in to reset PIN
ig: Banye iji dezigharịa ikike mbanye.

source: Simulate Payment
ig: ịkwụ ụdị ụgwọ yiri

source: Simulate Something?
ig: Myiri dịka?

source: Something went wrong.
ig: Onwere ihe mere.

source: Something went wrong. Try again?
ig: Onwere ihe mere. Nwaa ọzọ?

source: Super Simulate
ig: Myiri bụ ọkpọka

source: That took longer than expected. Retry?
ig: Ogburu oge karịa ka okwesịrị. Nwagharịa

source: The payment method or price point is not supported for this region or operator.
ig: Anaghị anabata usoro ịkwụ ụgwọ a n'oke ala ebe a.

source: The PIN data submitted was invalid.
ig: Ndekọ enyefere adabaghị.

source: The request timed out whilst attempting to create your PIN.
ig: Oge gwụrụ mgbe achọrọ ikepụta ikike mbanye gị.

source: The request timed out whilst attempting to reset your PIN.
ig: Oge gwụrụ mgbe achọrọ idezigharị ikike mbanye gị.

source: The request timed out whilst trying to check your PIN
ig: Oge gwụrụ mgbe ịchọrọ ile ikike mbanye gị

source: The system timed out while trying to log in.
ig: Oge dị n'igwe komputa gwụrụ mgbe ọ na anwa ịbanye

source: The system timed out while trying to log out.
ig: Oge gwụrụ mgbe ọchọrọ ịpụ.

source: The transaction failed. You have not been charged for this purchase.
ig: Azụahịa ahụ agaghị. Onwebeghị ego anara gị na ya.

source: This is taking longer than expected. Try again?
ig: ọ na-egbu oge karịa ka okwesịrị. Nwaa ọzọ?

source: Verifying payment
ig: Inyocha ụgwọ akwụrụ

source: Waiting for login
ig: Ichere maka mbanye

source: Was Locked
ig: Akpọchiri ya

source: Wrong PIN
ig: Ikike mbanye abụghị ya

source: You are signed in as:
ig: ịbanyere dịka:

source: You entered the wrong PIN too many times. Your account is locked. Please try your purchase again in 5 minutes.
ig: Itinyere nke abụghị ya ọtụtụ ugbo. Amachiela gị. Biko nwaa ọzọ na nkeji ise.

source: You logged in as a different user, you must start the payment again.
ig: ịbanyere dịka onye ọzọ. ị ga-ebido ịkwụ ụgwọ ọzọ

source: Your PIN was locked
ig: Agbachiela ikike mbanye gị

source: Your PIN was locked because you entered it incorrectly too many times. You can continue and try entering your PIN again or reset your PIN.
ig: Agbachiri ikike mbanye gị n'ihina itinyere nke abụghị ya ọtụtụ ugbo. Inwere ike ị ga n'ihu ma tinyekwa ya ọzọ maọbụ dezigharịa ikike mbanye gị.

source: Your purchase is complete. Close the window to continue
ig: Nzụta gị ezuola. Mechie mpio ahụ iji gaa n'ihu

source: You will not be charged.
ig: Agaghị ana gị ego.

source: {0} and {1} other replied
ig: {0} na {1} onye ọzọ zaghachiri{0} na {1} ndị ọzọ zaghachiri

source: {0} answer
ig: Azịza {0}

source: {0} documents
ig: {0} dọkụmentị

source: {0} question
ig: {0} ajụjụ

source: {0} replied
ig: {0} zaghachiri

source: {0} solution
ig: Asịsa {0}

source: 1 article can be viewed by 400 million users and translated into 70+ languages
ig: Ndị ọrụ dị nde 400 nwere ike ịlele 1 edemede, a na atụgharị ya n'ime asụsụ 70+

source: 1m
ig: 1ọ

source: 1 new this week
ig: 1 ọhụrụ n'izu a

source: 1 person has this problem
ig: 1 onye nwere nsogbu aNdị mmadụ {n} nwere nsogbu a

source: 1 post
ig: 1 mbisaMbisa {0}

source: 1 reply
ig: 1 nzaghachiNzaghachi {n}

source: 1 tweet can save 1 day
ig: 1 twiit nwere ike ịzọpụta 1 ụbọchị

source: 1 user removed from list!
ig: Ewepuru 1 onye ọrụ na ndepụta!Ewepuru ndị ọrụ %s na ndepụta!

source: 1 user unbanned successfully!
ig: Ahapụla 1 onye ọrụ na enweghị nsogbu!Ahapụla ndị ọrụ %s na enweghị nsogbu!

source: 1y
ig: 1a

source: 2008 L10n Badge
ig: Akara 2008 L10n

source: 2009 L10n Badge
ig: Akara 2009 L10n

source: 2010 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2010

source: 2010 KB Badge
ig: Akara 2010 KB

source: 2010 L10n Badge
ig: Akara 2010 L10n

source: 2010 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2010

source: 2011 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2011

source: 2011 KB Badge
ig: Akara 2011 KB

source: 2011 L10n Badge
ig: Akara 2011 L10n

source: 2011 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2011

source: 2012 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2012

source: 2012 KB Badge
ig: Akara 2012 KB

source: 2012 L10n Badge
ig: Akara 2012 L10n

source: 2012 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2012

source: 2013 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2013

source: 2013 KB Badge
ig: Akara 2013 KB

source: 2013 L10n Badge
ig: Akara 2013 L10n

source: 2013 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2013

source: 2014 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2014

source: 2014 KB Badge
ig: Akara 2014 KB

source: 2014 L10n Badge
ig: Akara 2014 L10n

source: 2014 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2014

source: 2015 Army of Awesome Badge
ig: Akara Igwe Ọmarịcha Ihe 2015

source: 2015 KB Badge
ig: Akara 2015 KB

source: 2015 L10n Badge
ig: Akara 2015 L10n

source: 2015 Support Forum Badge
ig: Akara Ọgbakọ Nkwado 2015

source: 3m
ig: ọ3

source: 6m
ig: ọ6

source: About Us
ig: Gbasara Anyị

source: About {user}
ig: Gbasara {user}

source: Abusive content
ig: Ọdịnaya jọrọ njọ

source: Accept
ig: Nabata

source: Accepted and Fixed
ig: Anabatara na Edoziri

source: Accepted formats include: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Learn more...</a>
ig: Nhazi ndị anabatara gụnyere: PNG, JPEG, GIF. <a target="_blank" href="{learn_more}">Mụtakwuo...</a>

source: Accept this Revision
ig: Nabata Ngụgharị a

source: Accept this Translation
ig: Nabata Ntụgharị Asụsụ a

source: Access and organize your favorite webpages easily with bookmarks and tabs
ig: Nweta ma hazie ibe weebụ ndị kachasị amasị gị na enweghị nhịahụ site na iji bukumakị na taabụ

source: Access denied
ig: Ajụrụ ohere

source: Access websites easily with bookmarks and tab features
ig: Nweta weebụsaịtị na enweghị nhịahụ site na iji bukumakị na atụmatụ taabụ

source: Account Administration
ig: Nchịkwa Akaụntụ

source: Account already activated
ig: Agbalitela akaụntụ

source: Account banned successfully!
ig: Amachiri akaụntụ na enweghị nsogbu!

source: Account is now being ignored!
ig: Elepụla anya na akaụntụ ugbu a!

source: Account Issues
ig: Nsogbu Akaụntụ

source: Account successfully verified!
ig: Enyochaala akaụntụ na enweghị nsogbu!

source: A confirmation email will be sent to this address in order to post your question.
ig: A ga-eziga email nkwenye na adreesị a iji bisa ajụjụ gị.

source: activation key
ig: igodo mgbalite
